<?php
// +----------------------------------------------------------------------
// | 基于ThinkPHP5开发
// +----------------------------------------------------------------------
// | Copyright (c) 2016-2021 http://www.mylucas.com.cn
// +----------------------------------------------------------------------
// | 基础框架永久免费开源
// +----------------------------------------------------------------------
// | Author: Lucas <598936602@qq.com>，开发者QQ群：*
// +----------------------------------------------------------------------
namespace app\index\home;
use app\common\controller\Common;

class Error extends Common
{
    public function _empty()
    {
        //return $this->error('这个模块是留给你自由发挥的<br>您也可以在后台指定其他模块为默认访问首页<br>路径：后台-系统-系统扩展-模块管理-设置默认模块', '', '', 100);
        return $this->redirect(get_domain().'/admin.php/system/publics/index.html');
    }
}
